---
kind: method
id: M:Autodesk.Revit.DB.ProjectPosition.Dispose
source: html/342ef4bf-f4a6-ecd3-99a9-d7002b196d33.htm
---
# Autodesk.Revit.DB.ProjectPosition.Dispose Method

Releases all resources used by the ProjectPosition

## Syntax (C#)
```csharp
public void Dispose()
```